=============================|||
Regular import string quoted
=============================|||

a: @"x.d2"
a -> b

---|||

(source_file
  (declaration
    (identifier)
    (import))
  (declaration
    (identifier)
    (connection)
    (identifier)))

============================|||
Spread import string quoted
============================|||

a: {
  ...@"x.d2"
}
a -> b

---|||

(source_file
  (declaration
    (identifier)
    (block
      (import)))
  (declaration
    (identifier)
    (connection)
    (identifier)))


=============================|||
Extension omit string quoted
=============================|||

x: @"x.d2"
x: @"x"

---|||

(source_file
  (declaration
    (identifier)
    (import))
  (declaration
    (identifier)
    (import)))


==========================================|||
Top level + Partial imports string quoted
==========================================|||

...@"people.management"
joe -> donuts: loves
jan -> donuts: brings

---|||

(source_file
  (import)
  (declaration
    (identifier)
    (connection)
    (identifier)
    (label))
  (declaration
    (identifier)
    (connection)
    (identifier)
    (label)))


===============================|||
Relative imports string quoted
===============================|||

y: @../y.d2

---|||

(source_file
  (declaration
    (identifier)
    (import)))


===============================|||
Escaped import module names
===============================|||

y: @"../y file.d2"
a: @"x file.d2"
d: @ x file.d2
b: @"x file"
c: @ x file
...@"people one".management
...@"test".'test'\\..test; decl

---|||

(source_file
  (declaration
    (identifier)
    (import))
  (declaration
    (identifier)
    (import))
  (declaration
    (identifier)
    (import))
  (declaration
    (identifier)
    (import))
  (declaration
    (identifier)
    (import))
  (import)
  (import
    (escape))
  (declaration
    (identifier)))
