==================|||
Isolated valid connections
==================|||

--
->
<-
<->

---|||

(source_file
  (expression
    (connection))
  (expression
    (connection))
  (expression
    (connection))
  (expression
    (connection)))
      
==================|||
Isolated long connections
==================|||

----------
--------->
<---------
<-------->

---|||

(source_file
  (expression
    (connection))
  (expression
    (connection))
  (expression
    (connection))
  (expression
    (connection)))
      
==================|||
Invalid connection "-"
==================|||

-

---|||

(source_file
  (expression
    (identifier)))

==================|||
Invalid connection ">"
==================|||

>

---|||

(source_file
  (ERROR
    (UNEXPECTED '>')))

==================|||
Invalid connection "<"
==================|||

<

---|||

(source_file
  (ERROR
    (UNEXPECTED '\n')))

==================|||
Invalid connection "<>"
==================|||

<>

---|||

(source_file
  (ERROR
    (UNEXPECTED '>')))

==================|||
Simple 1-1 connections
==================|||

Write Replica Canada <-> Write Replica Australia
Read Replica <- Master
Write Replica -> Master
Read Replica 1 -- Read Replica 2

---|||

(source_file
  (expression
    (identifier)
    (connection)
    (identifier))
  (expression
    (identifier)
    (connection)
    (identifier))
  (expression
    (identifier)
    (connection)
    (identifier))
  (expression
    (identifier)
    (connection)
    (identifier)))

==================|||
Connection labels
==================|||

Read Replica 1 -- Read Replica 2: Kept in sync

---|||

(source_file
  (expression
    (identifier)
    (connection)
    (identifier)
    (label)))
